app/controllers/landing_controller.rb

  def index
  	@items = Item.all
---
SELECT  "items".* FROM "items" WHERE ("items"."deleted_at" IS NULL)  ORDER BY created_at DESC LIMIT 1