app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("user_id") VALUES ($1) RETURNING "id"  [["user_id", 1]]
---
  def edit
    if current_user.profile.nil?
      current_user.build_profile
      current_user.profile.save

SELECT  "items".* FROM "items" WHERE ("items"."deleted_at" IS NULL)  ORDER BY created_at DESC LIMIT 1
---
   def set_items
       @items = Item.all