app/controllers/unlok_air_controller.rb

  def index
    if params[:category].eql?('helicopter')
      aircraft_category = ItemCategory.find_by(name: 'helicopter')
      @items = aircraft_category.items.all
---
SELECT  "item_categories".* FROM "item_categories" WHERE "item_categories"."name" = $1 LIMIT 1  [["name", "aircraft"]]
SELECT "items".* FROM "items" WHERE ("items"."deleted_at" IS NULL) AND "items"."item_category_id" = $1  ORDER BY created_at DESC  [["item_category_id", 1]]