app/views/layouts/_header.html.erb

SELECT  "item_categories".* FROM "item_categories" WHERE "item_categories"."name" = $1 LIMIT 1  [["name", "aircraft"]]
---
      <li class=<%= (params.include?('category') && params[:category].eql?('aircraft') ? 'selected' : '') %>>
       <% air = ItemCategory.find_by(name:'aircraft') %>